Revit 2027 API
SelectionChangedEventArgs.GetReferences Method
 Returns the references that are currently selected.
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<Reference> GetReferences()
Public Function GetReferences As IList(Of Reference)
public:
IList<Reference^>^ GetReferences()
member GetReferences : unit -> IList<Reference>
Return Value
IList<Reference>
 The collection containing the selected references.
Remarks
 The references can be an element or subelement in the host or a linked document.
See Also
Reference
SelectionChangedEventArgs Class
Autodesk.Revit.UI.Events Namespace